# EnergyAnalysisRoomSpaceData Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..EnergyAnalysisRoomSpaceData Property
GroupTypeId Class See Also
---
Room/Space Data.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId EnergyAnalysisRoomSpaceData { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property EnergyAnalysisRoomSpaceData As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ EnergyAnalysisRoomSpaceData {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace